# Read csv using pandas

In [1]:
# Import pandas
import pandas as pd

# reading csv file
pd.read_csv("C:/Users/Pranay/Downloads/penguins.csv")

        Island  CulmenLength  CulmenDepth  FlipperLength  BodyMass  Species
0    Torgersen          39.1         18.7          181.0    3750.0        0
1    Torgersen          39.5         17.4          186.0    3800.0        0
2    Torgersen          40.3         18.0          195.0    3250.0        0
3    Torgersen           NaN          NaN            NaN       NaN        0
4    Torgersen          36.7         19.3          193.0    3450.0        0
..         ...           ...          ...            ...       ...      ...
339      Dream          55.8         19.8          207.0    4000.0        2
340      Dream          43.5         18.1          202.0    3400.0        2
341      Dream          49.6         18.2          193.0    3775.0        2
342      Dream          50.8         19.0          210.0    4100.0        2
343      Dream          50.2         18.7          198.0    3775.0        2

[344 rows x 6 columns]

### Using sep in read_csv()

In [2]:
df = pd.read_csv('C:/Users/Pranay/Downloads/penguins.csv',
                 sep='[:, |_]',
                 engine='python')
  
# Print the Dataframe
df

        Island  CulmenLength  CulmenDepth  FlipperLength  BodyMass  Species
0    Torgersen          39.1         18.7          181.0    3750.0        0
1    Torgersen          39.5         17.4          186.0    3800.0        0
2    Torgersen          40.3         18.0          195.0    3250.0        0
3    Torgersen           NaN          NaN            NaN       NaN        0
4    Torgersen          36.7         19.3          193.0    3450.0        0
..         ...           ...          ...            ...       ...      ...
339      Dream          55.8         19.8          207.0    4000.0        2
340      Dream          43.5         18.1          202.0    3400.0        2
341      Dream          49.6         18.2          193.0    3775.0        2
342      Dream          50.8         19.0          210.0    4100.0        2
343      Dream          50.2         18.7          198.0    3775.0        2

[344 rows x 6 columns]

## Creating DataFrame to Export Pandas DataFrame to CSV

In [9]:
# list of name, degree, score
nme = ["Rutika", "Pranay", "Ayush", "Ritika"]
deg = ["MBA", "MCS", "M.Tech", "MCA"]
scr = [90, 77, 80, 98]

# dictionary of lists
dict = {'Name': nme, 'Degree': deg, 'Score': scr}
	
df = pd.DataFrame(dict)

print(df)

     Name  Degree  Score
0  Rutika     MBA     90
1  Pranay     MCS     77
2   Ayush  M.Tech     80
3  Ritika     MCA     98

In [10]:
# saving the dataframe
df.to_csv('C:/Users/Pranay/Azure Training-Biz/StdMarks.csv')

In [7]:
# saving the dataframe
df.to_csv('C:/Users/Pranay/Azure Training-Biz/StdMarks.csv', header=False, index=False)

# Loading Excel spreadsheet as pandas DataFrame

In [14]:
import pandas as pd

# Import the excel file and call it xls_file
excel_file = pd.ExcelFile('C:/Users/Pranay/Azure Training-Biz/StdMarks.xlsx')

# View the excel_file's sheet names
print(excel_file.sheet_names)

# Load the excel_file's Sheet1 as a dataframe
df = excel_file.parse('StdMarks')
print(df)

['StdMarks']
   Unnamed: 0    Name  Degree  Score
0           0  Rutika     MBA     90
1           1  Pranay     MCS     77
2           2   Ayush  M.Tech     80
3           3  Ritika     MCA     98

# Creating a dataframe using Excel files

In [16]:
# import pandas lib as pd
import pandas as pd

# read by default 1st sheet of an excel file
dataframe1 = pd.read_excel('C:/Users/Pranay/Azure Training-Biz/StdMarks.xlsx')

print(dataframe1)

   Unnamed: 0    Name  Degree  Score
0           0  Rutika     MBA     90
1           1  Pranay     MCS     77
2           2   Ayush  M.Tech     80
3           3  Ritika     MCA     98

In [17]:
# import pandas lib as pd
import pandas as pd

# read 2nd sheet of an excel file
dataframe2 = pd.read_excel('C:/Users/Pranay/Azure Training-Biz/StdMarks.xlsx', sheet_name ='StdMarks')

print(dataframe2)

   Unnamed: 0    Name  Degree  Score
0           0  Rutika     MBA     90
1           1  Pranay     MCS     77
2           2   Ayush  M.Tech     80
3           3  Ritika     MCA     98

In [20]:
# import pandas lib as pd
import pandas as pd

require_cols = [1, 3]

# only read specific columns from an excel file
required_df = pd.read_excel('C:/Users/Pranay/Azure Training-Biz/StdMarks.xlsx', usecols = require_cols)

print(required_df)

     Name  Score
0  Rutika     90
1  Pranay     77
2   Ayush     80
3  Ritika     98

In [21]:
# import pandas lib as pd
import pandas as pd

# read 2nd sheet of an excel file after
# skipping starting two rows
df = pd.read_excel('C:/Users/Pranay/Azure Training-Biz/StdMarks.xlsx', sheet_name = 'StdMarks', skiprows = 2)

print(df)

   1  Pranay     MCS  77
0  2   Ayush  M.Tech  80
1  3  Ritika     MCA  98

In [23]:
# import pandas lib as pd
import pandas as pd

# setting the 3rd row as header.
df = pd.read_excel('C:/Users/Pranay/Azure Training-Biz/StdMarks.xlsx', sheet_name = 'StdMarks', header = 2)

print(df)

   1  Pranay     MCS  77
0  2   Ayush  M.Tech  80
1  3  Ritika     MCA  98